backend/controllers/PersonalinfoController.php

    protected function findModel($Name)
    {
        if (($model = Personalinfo::findOne(['Name' => $Name])) !== null) {
---
SELECT * FROM `personalinfo` WHERE `Name`='王思宇'